import React, { Component } from 'react'
import bgContent from '../images/bg-content.svg'
import Layout from '../components/layout'

export default class Aboutus extends Component {

    render() {
        return (
            <Layout title="เกี่ยวกับเรา">
                <div className="my-5" style={bg}>
                    <div className="text-center" style={{ width: '50%', margin: 'auto', fontSize: '18px', fontFamily: '"Prompt", sans-serif' }}>
                        <h4 className="mb-5">About</h4>
                        <p>จากคน คนนึง ซึ่งเคยอยู่ในช่วงเวลาที่เรียกได้ว่าสุขภาพและร่างกายอยู่ในระดับย่ำแย่ อ้วน เหนื่อยไว ป่วยง่าย หมอส่ายหัว... จนเค้าได้ลอง และสัมผัสได้ว่าการ "วิ่ง" นั้น เปลี่ยนแปลงตัวเค้าไปในทางที่ดีขึ้น และเมื่อเค้าวิ่ง "ต่อไป" &nbsp;มันก็ได้เปลี่ยนสุขภาพและร่างกายของเค้าจาก ย่ำแย่ เป็น ยอดเยี่ยม</p>
                        <p>
                            <br />
                        </p>
                        <p>2 ปีหลังจากเริ่มวิ่ง คนๆเดิม ที่ผ่านการฝึกซ้อมและแข่งขันมามากมาย จากคนเหนื่อยไว กลายเป็นนักวิ่งที่สามารถพิชิต 42.195KM ได้สำเร็จ ประสบการณ์ต่างๆนาๆมากมาย ทำให้เกิดมุมมอง และความคิดที่น่าสนใจหลายๆอย่าง จนเค้ามีความคิดที่อยากจะสร้างพื้นที่ให้ใครๆก็สามารถเริ่มวิ่งได้ &nbsp;และได้ "วิ่งต่อไป" อย่างที่ต้องการ&nbsp;</p>
                        <p>
                            <br />
                        </p>
                        <p>จากนักวิ่งคนนึง ที่ได้บอกเล่าเรื่องราวให้กับคนไม่ธรรมดาอีกคนนึง ความคิดต่างๆ ถูกต่อยอด จนเริ่มก่อตัวเป็นโปรเจ็กสนุกๆ และพัฒนาไปสู่โปรเจ็กที่จริงจังและท้าทาย</p>
                        <p>
                            <br />
                        </p>
                        <p>&nbsp;RUNEX จึงได้ถือกำเนิดขึ้น แน่นอนว่าเพื่อใครก็ตามที่อยากจะวิ่ง สนุกกับการวิ่ง และท้ายทายไปกับการวิ่งในระดับและรูปแบบต่างๆ ด้วยการเป็นแหล่งรวมของ Events งานวิ่ง และเครื่องมือในการจัด Events งานวิ่ง ทั้ง Virtual Run และ Physical Run &nbsp;ให้ทั้งมือใหม่และมือเก๋าได้เลือกสนุกไม่แพ้กัน พร้อมรับสุขภาพดีๆ หรือบางทีอาจจะได้ช่วยเหลือสังคมไปพร้อมๆกัน</p>
                        <p>
                            <br />
                        </p>
                        {/* <p>
                        ธนาคาร : ธนาคารกสิกรไทย&nbsp;
                    </p>
                    <p>
                        หมายเลขบัญชี : 674-2-04828-2&nbsp;
                    </p>
                    <p>
                        ชื่อบัญชี : บจก. ธิงค์เทคโนโลยี&nbsp;
                    </p>
                    <p>
                        <br />
                    </p> */}
                        <p>
                            <br />
                        </p>
                        <p>Run for good health. Run for good thing.&nbsp;</p>
                        <p>
                            <br />
                        </p>
                        <p>Runex</p>
                    </div>
                </div>
            </Layout>
        )
    }
}

const bg = {
    backgroundImage: `url(${bgContent})`,
    minHeight: '857px',
    backgroundPosition: 'center',
    backgroundRepeat: 'no-repeat',
    backgroundSize: 'cover'
}
