import React, { Component } from 'react'
import bgContent from '../images/bg-content.svg'
import Layout from '../components/layout'

export default class RefundPolicy extends Component {

    render() {
        return (
            <Layout title="นโยบายการคืนเงิน / คืนสินค้า / ยกเลิก">
                <div className="my-5" style={bg}>
                    <div className="text-center" style={{ width: '50%', margin: 'auto', fontSize: '18px', fontFamily: '"Prompt", sans-serif' }}>
                        <p><strong>นโยบายการคืนเงิน / คืนสินค้า / ยกเลิก</strong></p>
                        <p><strong>สำหรับค่าสมัครงานวิ่ง</strong></p>
                        <p>ค่าสมัครงานวิ่ง รวมถึงค่าธรรมเนียม, ค่าบริการ หรือค่าใช้จ่ายในการดำเนินการต่างๆไม่สามารถคืนได้ ไม่สามารถขอคืนเงินได้ในทุกกรณี เว้นแต่ทางผู้จัดงานวิ่งได้ทำการยกเลิกการจัดงานวิ่งนั้น</p>
                        <p><br /><br /></p>
                        <p><strong>สำหรับสินค้า</strong></p>
                        <p><strong>การขอเปลี่ยนสินค้า/คืนเงิน</strong></p>
                        <p>ผู้ซื้อสามารถขอเปลี่ยนสินค้า/คืนเงินที่ซื้อได้ ภายใน 7 วัน หลังจากที่รับสินค้าไปแล้ว โดยมีสาเหตุมาจาก</p>
                        <ul>
                            <li>สินค้ามีตำหนิ และ/หรือ เกิดการเสียหายระหว่างการจัดส่ง</li>
                            <li>สินค้าที่ได้รับไม่ตรงกับลักษณะเฉพาะที่ได้เลือกไว้ เช่น สี, ไซส์</li>
                            <li>สินค้าที่ได้รับมีลักษณะไม่ตรงกับรายละเอียดสำคัญที่ได้แจ้งไว้</li>
                            <li>ไม่ได้รับสินค้า</li>
                            <li>สาเหตุจากการเปลี่ยนใจไมสามารถใช้ได้</li>
                        </ul>
                        <p><strong>ขั้นตอนการเปลี่ยนสินค้า/คืนเงิน</strong></p>
                        <p>1. ผู้ซื้อจะต้องติดต่อเจ้าหน้าที่ เพื่อประสานงาน ในเวลา 09.00 - 18.00 วันจันทร์ ถึง ศุกร์ เว้นวันหยุดนักขัตฤกษ์ ผ่านทาง Line :<a href="https://runex.co/">runex.co</a>, Phone : 084 519 6556, Email : <a href="mailto:contact@runex.co">contact@runex.co</a></p>
                        <p>2. ผู้ซื้อจะต้องทำการจัดส่งสินค้ากลับมายังบริษัท ด้วยวิธีที่สามารถตรวจสอบการจัดส่งได้เช่น EMS โดยสภาพสินค้า, ป้ายราคา, ป้ายยี่ห้อ, อุปกรณ์เสริม, สินค้าให้ฟรี คู่มือและเอกสารประกอบต่างๆ ยังคงอยู่ และบรรจุในหีบห่อบรรจุภัณฑ์ของสินค้านั้นๆ ในอยู่ในสภาพเดียวกับที่บริษัทนำส่งให้ผู้ซื้อ หรือในสภาพที่ได้ประสานงานไว้ในกรณี สินค้ามีตำหนิ และ/หรือ เกิดการเสียหายระหว่างการจัดส่ง</p>
                        <p>3. เมื่อทางบริษัทได้รับสินค้าและตรวจสอบและพบว่าเป็นไปตามกรณีที่ผู้ซื้อได้แจ้งประสานงานไว้แล้ว บริษัทจะทำการเปลี่ยนสินค้า/คืนเงินแล้วแต่กรณี</p>
                        <p>บริษัทขอสงวนสิทธ์ในการพิจารณาการขอเปลี่ยนสินค้า/คืนเงิน ตามข้อมูลและหลักฐานที่ผู้ซื้อได้แจ้งเข้ามา</p>
                    </div>
                </div>
            </Layout>
        )
    }
}

const bg = {
    backgroundImage: `url(${bgContent})`,
    minHeight: '857px',
    backgroundPosition: 'center',
    backgroundRepeat: 'no-repeat',
    backgroundSize: 'cover'
}
