import React, { Component } from 'react'
// import bgContent from '../assets/bg-content.svg'
import Layout from '../components/layout'

export default class TermsAndCondition extends Component {

    render() {
        return (
            <Layout title="ข้อตกลงและเงื่อนไขการใช้งาน">
                <div className="my-5" >
                    <div className="text-center" style={{ width: '50%', margin: 'auto', fontSize: '18px', fontFamily: '"Prompt", sans-serif' }}>
                        <h4 className="mb-5">Terms and Conditions</h4>
                        <h2 dir="ltr"><strong>ข้อตกลงและเงื่อนไขการใช้งาน</strong></h2>
                        <p dir="ltr"><span className="Apple-tab-span">&nbsp; &nbsp;&nbsp;</span><span className="Apple-tab-span">&nbsp; &nbsp;&nbsp;</span></p>
                        <p dir="ltr">กรุณาอ่านและทำความเข้าใจ ข้อตกลงและเงื่อนไขการใช้งาน เมื่อท่านเข้าชมไปจนถึงการดำเนินการใดๆ บนเว็บไซต์ runex.co ผ่านทางแพลตฟอร์ม อุปกรณ์ หรือ รูปแบบใดๆ ถือว่าท่านยอมรับและยินยอมโดยสมัครใจ ในการปฏิบัติตามเงื่อนไขและข้อกำหนดที่บริษัทฯระบุไว้นี้ ทุกประการ ทั้งนี้เราขอสงวนสิทธิ์ในการเปลี่ยนแปลง ข้อตกลงและเงื่อนไขการใช้งาน เหล่านี้โดยไม่ต้องแจ้งให้ทราบล่วงหน้า</p>
                        <p>&nbsp;</p>
                        <h2 dir="ltr">นโยบายความเป็นส่วนตัว</h2>
                        <p dir="ltr">เว็บไซต์ runex.co ให้ความสำคัญกับความเป็นส่วนตัวและความปลอดภัยของข้อมูลส่วนตัวของผู้ใช้ ข้อมูลที่มีเกิดจากการใช้งานหรือดำเนินการใดๆ บนเว็บไซต์ runex.co ถือว่าผู้ใช้ยินยอมหรือไว้วางใจ ที่จะเปิดเผยและส่งมอบข้อมูลส่วนตัวแก่เรา โดยเราจะเก็บข้อมูลของท่านเป็นความลับ เว้นแต่เพื่อดำเนินการในการให้บริการ และ/หรือ ผู้ใช้ยินยอมให้เปิดเผย</p>
                        <p>&nbsp;</p>
                        <h2 dir="ltr">การใช้ข้อมูล</h2>
                        <p dir="ltr">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; ข้อมูลที่ท่านเปิดเผยกับเว็บไซต์ runex.co อาจถูกนำไปใช้ในการปรับปรุง และส่งเสริมการให้บริการ การตลาด การพัฒนาบริการของเว็บไซต์นี้ เพื่อความพึงพอใจและประโยชน์สูงสุดของท่าน นอกจากนี้แล้ว เว็บไซต์ runex.co ขอสงวนสิทธิที่จะนำข้อมูลของท่านมาใช้ในการวิเคราะห์ข้อมูลได้ตลอดเวลา</p>
                        <p>&nbsp;</p>
                        <h2 dir="ltr">การแก้ไข เปลี่ยนแปลง และลบข้อมูล</h2>
                        <p dir="ltr">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; ท่านสามารถแก้ไข ปรับปรุง เปลี่ยนแปลง ข้อมูลต่างๆ ในข้อมูลส่วนตัวของท่านได้ด้วยตนเอง โดยใช้ชื่อผู้ใช้ที่เป็นสมาชิกและรหัสผ่านที่ทางเว็บไซต์ runex.co โดยใช้ชื่อผู้ใช้ที่เป็นสมาชิกและรหัสผ่านของท่านเอง runex.co ขอแนะนำให้ท่านเก็บข้อมูลชื่อผู้ใช้ที่เป็นสมาชิกและรหัสผ่านไว้เป็นความลับ ทั้งนี้ ท่านจะต้องรับผิดชอบกับการกระทำต่างๆ ภายใต้ชื่อผู้ใช้ที่เป็นสมาชิกและรหัสผ่านของท่าน ทาง runex.co จะไม่รับผิดชอบหากท่านนำชื่อผู้ใช้ที่เป็นสมาชิกและรหัสผ่านของท่านไปให้ผู้อื่น</p>
                        <p>&nbsp;</p>
                        <p>&nbsp;</p>
                        <h2 dir="ltr">นโยบายคุ้มครองข้อมูล</h2>
                        <p dir="ltr">เว็บไซต์ runex.co เคารพสิทธิในข้อมูลและความเป็นส่วนตัวของท่าน ข้อมูลของผู้ใช้ที่ runex.co ได้รับนั้นโดยหลักการแล้วจะถูกนำไปใช้ตามวัตถุประสงค์ของเว็บไซด์นี้เท่านั้น จะไม่มีการอนุญาตให้มีการเปิดเผยข้อมูลของผู้ใช้นอกจากพนักงานผู้ที่ได้รับอนุญาตเท่านั้น และเว้นแต่ได้รับความยินยอมจากผู้ใช้ หรือเป็นการจำเป็นที่ต้องเปิดเผยข้อมูลตามกฎหมาย&nbsp;</p>
                        <p dir="ltr">เว็บไซต์ runex.co อาจมีการเชื่อมโยงไปยังเว็บไซต์อื่นๆที่ไม่อยู่ภายใต้ การควบคุมของเรา เราไม่สามารถรับผิดชอบต่อ การป้องกันและความเป็นส่วนตัวของข้อมูลใดๆที่คุณให้ในขณะที่การเยี่ยมชมเว็บไซต์ดังกล่าว และยอมรับความรับผิดชอบหรือไม่รับผิดสำหรับ เนื้อหาหรือการใช้งานของเว็บไซต์ของบุคคลที่สามเหล่านี้ เราขอแนะนำให้คุณอ่านนโยบายความเป็นส่วนตัวของเว็บไซต์ของบุคคลที่สามในแต่ละเว็บไซต์ที่คุณใช้งาน</p>
                    </div>
                </div>
            </Layout>
        )
    }
}

// const bg = {
//     backgroundImage: `url(${bgContent})`,
//     minHeight: '857px',
//     backgroundPosition: 'center',
//     backgroundRepeat: 'no-repeat',
//     backgroundSize: 'cover'
// }
